RSN/src/Catalogs/ПрофилиГруппДоступаИнформационныхБаз/ПрофилиГруппДоступаИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрофилиГруппДоступаИнформационныхБаз</name>
  <owners>Catalog.ИнформационныеБазы</owners>
  <tabularSections>
    <name>ГруппыДоступа</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RSN/src/Catalogs/ПрофилиГруппДоступаИнформационныхБаз/ManagerModule.bsl
Процедура ЗаполнитьПрофили(СпрГруппа, НастройкиАвторизации = Неопределено) Экспорт  
	
	Если НастройкиАвторизации = Неопределено Тогда	
		
		Настройки = Новый Структура("Логин,Пароль"); 
		Настройки.Логин = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("CDM_USER", "Логин");
		Настройки.Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("CDM_USER", "Пароль");
		Аутентификация = Новый Структура("Аутентификация", Новый Структура("Пользователь, Пароль", Настройки.Логин, Настройки.Пароль)); 
		
	Иначе
		
		Аутентификация = Новый Структура("Аутентификация", Новый Структура("Пользователь, Пароль", НастройкиАвторизации.ИмяПользователя, НастройкиАвторизации.Пароль));
		
	КонецЕсли; 
		
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ВыделенныеСтроки", СпрГруппа);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрофилиГруппДоступаИнформационныхБаз.Ссылка КАК Ссылка,
		|	ПрофилиГруппДоступаИнформационныхБаз.Владелец.ПутьНаВебСервере КАК ПутьНаВебСервере
		|ИЗ
		|	Справочник.ПрофилиГруппДоступаИнформационныхБаз КАК ПрофилиГруппДоступаИнформационныхБаз
		|ГДЕ
		|	ПрофилиГруппДоступаИнформационныхБаз.Ссылка В(&ВыделенныеСтроки)";
	
	РезультатЗапроса = Запрос.Выполнить();   
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл                      
		
		Попытка 
			
			//если ПоискПоПрофилю, то права добавляются по справочнику ПрофилиГруппДоступа, в противном случае - ГруппыДоступа.
			Ответ = Интеграция.ОбратитьсяКВебСервису(Выборка.ПутьНаВебСервере, "GET", "DataProcessings/UserAccessGroupsSettings", Аутентификация);
			Если ТипЗнч(Ответ) = Тип("Структура") И Ответ.Свойство("error") И Ответ.error Тогда
				ОбщегоНазначения.СообщитьПользователю("Ошибка при получении информации о настройках добавления пользователей по адресу " + Выборка.ПутьНаВебСервере + Символы.ПС + Ответ.message);
				Продолжить;
			КонецЕсли;
			
			ИмяСправочникаПоиска = ?(Ответ.ПоискПоПрофилю, "Catalogs/AccessGroupProfiles", "Catalogs/AccessGroups");
				
			ПараметрыЗапроса = Новый Структура("ElementsOnly, NoDeletionMark, Fields", Истина, Истина, "Наименование");   		                              
			Ответ = Интеграция.ОбратитьсяКВебСервису(Выборка.ПутьНаВебСервере, "GET", ИмяСправочникаПоиска, Аутентификация, ПараметрыЗапроса);			
			Если ТипЗнч(Ответ) = Тип("Структура") И Ответ.Свойство("error") И Ответ.error Тогда
				ОбщегоНазначения.СообщитьПользователю("Ошибка при получении информации о профилях по адресу " + Выборка.ПутьНаВебСервере + Символы.ПС + Ответ.message);
				Продолжить;
			КонецЕсли;  
			
			ЗаполнитьПрофилиГруппДоступаПоОтветуСервиса(Ответ, Выборка.Ссылка);			
			
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Ошибка при подключении по адресу " + Выборка.ПутьНаВебСервере + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		КонецПопытки;
					
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьПрофилиГруппДоступаПоОтветуСервиса(Ответ, ПрофильСсылка)
	
	ИменаПрофилейГруппДоступа = Новый Массив; 		
	Для Каждого Стр ИЗ Ответ Цикл   
		ИменаПрофилейГруппДоступа.Добавить(СокрЛП(Стр.Наименование));			
	КонецЦикла;   		
	ИменаПрофилейГруппДоступа = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ИменаПрофилейГруппДоступа);  
	
	Если ИменаПрофилейГруппДоступа.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПрофильГруппДоступа = ПрофильСсылка.ПолучитьОбъект(); 
	ПрофильГруппДоступа.ГруппыДоступа.Очистить();
	Для Каждого Стр Из ИменаПрофилейГруппДоступа Цикл			
		НовСтр = ПрофильГруппДоступа.ГруппыДоступа.Добавить();
		НовСтр.Имя = Стр; 
	КонецЦикла;
	ПрофильГруппДоступа.Записать();
	
КонецПроцедуры
